Revit 2024 API
ParameterTypeId.StructuralConnectionEditRangesOfApplicability Property
 "Modify Ranges of applicability"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralConnectionEditRangesOfApplicability { get; }
Visual Basic
Public Shared ReadOnly Property StructuralConnectionEditRangesOfApplicability As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralConnectionEditRangesOfApplicability {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace